Revit 2024 API
FabricationConfiguration.GetFabricationConnectorGroup Method
 Gets the fabrication connector group from its identifier.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public string GetFabricationConnectorGroup(
	int fabricationConnectorId
)
Visual Basic
Public Function GetFabricationConnectorGroup ( _
	fabricationConnectorId As Integer _
) As String
Visual C++
public:
String^ GetFabricationConnectorGroup(
	int fabricationConnectorId
)
Parameters
fabricationConnectorId
Type: System.Int32
 The fabrication connector identifier.
Return Value
 The fabrication connector's group.
See Also
FabricationConfiguration Class
Autodesk.Revit.DB Namespace